Revit 2026 API

# RouteAnalysisSettingsGetRouteAnalysisSettings Method

---

Returns the RouteAnalysisSettings element for a given document.

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static RouteAnalysisSettings GetRouteAnalysisSettings(
	Document cda
)
```
```vb
Public Shared Function GetRouteAnalysisSettings (
	cda As Document
) As RouteAnalysisSettings
```
```cpp
public:
static RouteAnalysisSettings^ GetRouteAnalysisSettings(
	Document^ cda
)
```
```fsharp
static member GetRouteAnalysisSettings :
        cda : Document -> RouteAnalysisSettings
```

#### Parameters

cda Document
     The document for which to get the RouteAnalysisSettings element.

#### Return Value

RouteAnalysisSettings

Returns the RouteAnalysisSettings element in project documents or  for family documents

.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

Project documents have a RouteAnalysisSettings element, one per document. Family documents do not have RouteAnalysisSettings elements.

#### Reference

RouteAnalysisSettings Class

Autodesk.Revit.DB.Analysis Namespace